Examinator/src/Catalogs/ОрганизаторыСУО/ОрганизаторыСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОрганизаторыСУО</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Видимость</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ОН/ДанныеВебКабинетаСУО_ОН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ОН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ПН/ДанныеВебКабинетаСУО_ПН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ПН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыДанныхВебКабинетаСУО/ТипыДанныхВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхВебКабинетаСУО</name>
  <enumValues>
    <name>УчебнаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>РезультатыТестирования</name>
  </enumValues>
  <enumValues>
    <name>УчастникОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеЗаявки</name>
  </enumValues>
  <enumValues>
    <name>РазделФорума</name>
  </enumValues>
  <enumValues>
    <name>РазделФорумаОписание</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщения</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщенияОписание</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОписание</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>БиблиотекаПользователя</name>
  </enumValues>
  <enumValues>
    <name>Новость</name>
  </enumValues>
  <enumValues>
    <name>НовостьОписание</name>
  </enumValues>
  <enumValues>
    <name>КнигаОписание</name>
  </enumValues>
  <enumValues>
    <name>КаталогПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПользовательОписание</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппаОписание</name>
  </enumValues>
  <enumValues>
    <name>ФайлУчащегося</name>
  </enumValues>
  <enumValues>
    <name>ПреподавателиПользователя</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>ОценкиКачестваОбучения</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ФорматыВебДанныхСУ/ФорматыВебДанныхСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыВебДанныхСУ</name>
  <enumValues>
    <name>xml</name>
  </enumValues>
  <enumValues>
    <name>json</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ОрганизаторыСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Процедура ОрганизаторыПользователя(Пользователь, Организаторы) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОрганизаторыСУО.Ссылка КАК Организатор
		|ИЗ
		|	Справочник.ОрганизаторыСУО КАК ОрганизаторыСУО
		|ГДЕ
		|	ОрганизаторыСУО.ПометкаУдаления = ЛОЖЬ
		|	И ОрганизаторыСУО.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Организаторы.Найти(ВыборкаДетальныеЗаписи.Организатор) = Неопределено Тогда
			Организаторы.Добавить(ВыборкаДетальныеЗаписи.Организатор);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЭлементИмеетОрганизаторов(СсылкаНаЭлемент) Экспорт
	
	Если СсылкаНаЭлемент = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МетаданныеЭлемента = СсылкаНаЭлемент.Метаданные();
	
	Если МетаданныеЭлемента.ТабличныеЧасти.Найти("Организаторы") = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Процедура ОрганизаторыЭлемента(СсылкаНаЭлемент, Организаторы) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭлементИмеетОрганизаторов(СсылкаНаЭлемент) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизаторыЭлемента.Организатор
		|ИЗ
		|	%1.Организаторы КАК ОрганизаторыЭлемента
		|ГДЕ
		|	ОрганизаторыЭлемента.Ссылка = &СсылкаНаЭлемент";		
		
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Запрос.Текст, ОбщегоНазначения.ИмяТаблицыПоСсылке(СсылкаНаЭлемент));	
		
	Запрос.УстановитьПараметр("СсылкаНаЭлемент", СсылкаНаЭлемент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Организатор)
			И Организаторы.Найти(ВыборкаДетальныеЗаписи.Организатор) = Неопределено Тогда
			
			Организаторы.Добавить(ВыборкаДетальныеЗаписи.Организатор);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьОрганизаторы(ТабличнаяЧасть, Организаторы) Экспорт
	
	Для каждого Организатор Из Организаторы Цикл
	
		Если ТипЗнч(Организатор) = Тип("СправочникСсылка.ОрганизаторыСУО")
			И ЗначениеЗаполнено(Организатор)
			И ТабличнаяЧасть.Найти(Организатор, "Организатор") = Неопределено Тогда
			
			НоваяСтрока = ТабличнаяЧасть.Добавить();			
			НоваяСтрока.Организатор = Организатор;
			
		КонецЕсли;		
	
	КонецЦикла;		
	
КонецПроцедуры


// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(Организатор, ДополнительныеДанные=Неопределено) Экспорт
	


	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеОрганизатора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организатор, "Ссылка, ПометкаУдаления, ДляВсех, Пользователь, Наименование, Описание");
	
	Зависимости = Новый Массив;
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(Организатор, Перечисления.ТипыДанныхВебКабинетаСУО.Организатор);	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(Организатор, Перечисления.ТипыДанныхВебКабинетаСУО.Организатор);		
	РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.УдалитьДанные(Организатор, "Справочник.ОрганизаторыСУО");
	
	Если НЕ ДанныеОрганизатора.ПометкаУдаления Тогда
		
		ОрганизаторJSON = ОрганизаторJSON(ДанныеОрганизатора, Зависимости);
		
		Если ДанныеОрганизатора.ДляВсех Тогда
			
			РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.Организатор, Организатор, ОрганизаторJSON, Перечисления.ФорматыВебДанныхСУ.json);
			
		Иначе
	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОрганизаторыСУОВидимость.Пользователь
				|ИЗ
				|	Справочник.ОрганизаторыСУО.Видимость КАК ОрганизаторыСУОВидимость
				|ГДЕ
				|	ОрганизаторыСУОВидимость.Ссылка = &Организатор";
			
			Запрос.УстановитьПараметр("Организатор", Организатор);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВидимостьОрганизатора = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Пользователь");
			
			Для каждого Пользователь Из ВидимостьОрганизатора Цикл
				РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.Организатор, Организатор, ОрганизаторJSON, Перечисления.ФорматыВебДанныхСУ.json);
			КонецЦикла;			
			
		КонецЕсли;
		
		// Зависимости
		
		РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.ДобавитьДанные(Организатор, "Справочник.ОрганизаторыСУО", Зависимости);
		
	КонецЕсли;
	
	
	
КонецПроцедуры

Функция ОрганизаторJSON(ДанныеОрганизатора, Зависимости=Неопределено) 
	
	ОписаниеОрганизатора = Новый Структура("
	|Наименование,
	|Идентификатор,
	|Пользователь,
	|Описание",
	ДанныеОрганизатора.Наименование,
	Строка(ДанныеОрганизатора.Ссылка.УникальныйИдентификатор()),
	Строка(ДанныеОрганизатора.Пользователь.УникальныйИдентификатор()),
	ДанныеОрганизатора.Описание);
	
	Если Зависимости <> Неопределено Тогда
		Зависимости.Добавить(ДанныеОрганизатора.Пользователь);
	КонецЕсли;	
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеОрганизатора);
	
КонецФункции

#КонецЕсли
